import threading
import time
from tkinter import DISABLED, NORMAL
# ---------------
L = None
# ---------------
Gtime = int(0)
Ttime = str('Ночь')
# ---------------
Лейка = int(0)
Вскапывание = int(0)
Удобрение = int(1)
Удобрение_В = int(0)
Шторы = int(0)
# --------------------------------------------------------------------------------
class Растения:
    def __init__ (self, Влажность = int(25), Освещённость = int(0), ПЭ = int(0)):
        self.Влажность = Влажность
        self.Освещённость = Освещённость
        self.ПЭ = ПЭ
    # ----------------------------- Обновление данных -----------------------------
    def Update (self):
        from Mein import Lb1, Lb2, Lb3, Lb6
        Lb1.config(text = f'Влажность: {self.Влажность}')
        Lb2.config(text = f'Освещённость: {self.Освещённость}')
        Lb3.config(text = f'ПЭ: {self.ПЭ}')
        Lb6.config(text = f'Время: {Ttime}')
    # ----------------------------- Блокировка кнопок -----------------------------
    def Off_Button(self):
        from Mein import Bt1, Bt2, Bt3, Bt4, Bt5
        Bt = [Bt1, Bt2, Bt3, Bt4, Bt5]
        for btn in Bt:
            btn.config(state=DISABLED)
    # ------------------------------------ Цикл -----------------------------------
    def Ttime (self):
        while True:
            from Mein import Lb5
            global Gtime, Ttime, С_Влажность
            # --------------------------- Ход времени ---------------------------
            time.sleep(0.8)
            Gtime += 1
            # -----------------------
            if Gtime < 25:
                Ttime = 'Утро'
                self.Влажность -= 1
            # -----------------------
            elif Gtime < 50:
                Ttime = 'День'
                self.Влажность -= 2
            # -----------------------
            elif Gtime < 75:
                Ttime = 'Вечер'
                self.Влажность -= 1
            # -----------------------
            elif Gtime < 100:
                Ttime = 'Ночь'
                self.Влажность -= 1
            # -----------------------
            else:
                Gtime = 0
            # -------------------------------------------------------------
            if  Шторы == 1 and (Ttime == 'Утро' or Ttime == 'Вечер' or Ttime == 'День'):
                # -----------------------------
                if Ttime == 'День':
                    self.Освещённость += 2
                # -----------------------------
                elif Ttime == 'Утро' or 'Вечер': self.Освещённость += 1
            # ---------------------------------
            else:
                self.Освещённость -= 1
            # ---------------------------------
            self.Update()
            print(Ttime, Gtime)
            print(Шторы)
            # ----------------------- Проверка смертности -----------------------
            if (60 > self.Влажность >= 50) or (60 > self.Освещённость >= 50) or (0 >= self.Влажность > -10) or (0 >= self.Освещённость > -10):
                Lb5.config(text='Статус: Аааа.. Плохо!', fg='orange')
            # -------------------------------------------------------------
            elif (self.Влажность >= 60) or (self.Освещённость >= 60) or (self.Влажность <= -10) or (self.Освещённость <= -10):
                Lb5.config(text=f'Статус: Всё! Смэрть..', fg='red')
                self.Off_Button()
                break
            else:
                Lb5.config(text=f'Статус: Всё вроде ок', fg='black')
    # -------------------------------- Функции кнопок ----------------------------
    def Долить_1 (self):
        from Mein import Lb4, Bt1, Bt4
        global Лейка, L
        Bt = [Bt1, Bt4]
        # -------------------
        for btn in Bt:
            btn.config(state=DISABLED)
        while Лейка < 100:
            time.sleep(1)
            Лейка += 10
            # -------------------
            Lb4.config(text = f'В Лейке : {Лейка} литров')

        for btn in Bt:
            btn.config(state=NORMAL)

    # ----------------------------------------------------------------------------
    def Долить_2 (self):
        global L
        if L is None or not L.is_alive():
            L = threading.Thread(target=self.Долить_1, daemon=True)
            L.start()
    # ----------------------------------------------------------------------------
    def Полить (self):
        from Mein import Lb4
        global Лейка, С_Влажность
        # ------------------------
        if Лейка >= 10:
            Лейка -= 10
            self.Влажность += 10
            Lb4.config(text=f'В Лейке : {Лейка} литров')
            print(self.Влажность)

        # ------------------------
        else:
            pass
    # ----------------------------------------------------------------------------
    def Вскопать (self):
        global Вскапывание, Удобрение_В
        # -------------------------------------------
        if Вскапывание <=4:
            Вскапывание += 1
        #--------------------------------------------
        elif Вскапывание == 5 and Удобрение_В == 0:
            pass
        # -------------------------------------------
        elif Вскапывание <= 9 and Удобрение_В == 1:
            Вскапывание += 1
        # -------------------------------------------
        else:
            pass
    # ----------------------------------------------------------------------------
    def Удобрить (self):
        from Mein import Bt3
        global Удобрение_В, Удобрение
        # ----------------------------
        if Удобрение >= 1:
            # ----------------------------------------------------------
            if Вскапывание == 5:
                Удобрение_В += 1
                Удобрение -= 1
                self.ПЭ += 1
                print (f'Удобрение добавлено: {Удобрение_В}')
                Bt3.config(text = f'Компостер {Удобрение}')
            # ----------------------------------------------------------
            else:
                print(f'Земля недостаточно вспаханная: {Вскапывание}')
        # --------------------------------------------------------------
        else:
            print(f'Недостаточно удобрений: {Удобрение}')
    # ----------------------------------------------------------------------------
    def Осветить (self):
        from Mein import Bt5
        global Шторы
        # -----------------
        if Шторы == 1:
            Шторы -= 1
            Bt5.config(text='Открыть шторы')
        # -----------------
        elif Шторы == 0:
            Шторы += 1
            Bt5.config(text='Закрыть шторы')
# --------------------------------------------------------------------------------
Stat = Растения()
T = threading.Thread(target = Stat.Ttime, daemon = True)

